a-trillet/PSOCprojectRainDisdrometer/Bluetooth/BLEled.cydsn/codegentemp/cyfitter_sysint.h
/*******************************************************************************
* File Name: cyfitter_sysint.h
* 
* PSoC Creator  4.4
*
* Description:
* 
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#ifndef INCLUDED_CYFITTER_SYSINT_H
#define INCLUDED_CYFITTER_SYSINT_H
#include "cy_device_headers.h"

/* ADC_IRQ */
#define ADC_IRQ__INTC_CORTEXM4_ASSIGNED 1
#define ADC_IRQ__INTC_CORTEXM4_PRIORITY 7u
#define ADC_IRQ__INTC_NUMBER 138u
#define ADC_IRQ_INTC_CORTEXM4_ASSIGNED 1
#define ADC_IRQ_INTC_CORTEXM4_PRIORITY 7u
#define ADC_IRQ_INTC_NUMBER 138u

/* Isr_Timer */
#define Isr_Timer__INTC_CORTEXM4_ASSIGNED 1
#define Isr_Timer__INTC_CORTEXM4_PRIORITY 7u
#define Isr_Timer__INTC_NUMBER 90u
#define Isr_Timer_INTC_CORTEXM4_ASSIGNED 1
#define Isr_Timer_INTC_CORTEXM4_PRIORITY 7u
#define Isr_Timer_INTC_NUMBER 90u

/* UART_SCB_IRQ */
#define UART_SCB_IRQ__INTC_CORTEXM4_ASSIGNED 1
#define UART_SCB_IRQ__INTC_CORTEXM4_PRIORITY 7u
#define UART_SCB_IRQ__INTC_NUMBER 46u
#define UART_SCB_IRQ_INTC_CORTEXM4_ASSIGNED 1
#define UART_SCB_IRQ_INTC_CORTEXM4_PRIORITY 7u
#define UART_SCB_IRQ_INTC_NUMBER 46u

/* BLE_bless_isr */
#define BLE_bless_isr__INTC_CORTEXM0P_ASSIGNED 1
#define BLE_bless_isr__INTC_CORTEXM0P_MUX 3u
#define BLE_bless_isr__INTC_CORTEXM0P_PRIORITY 3u
#define BLE_bless_isr__INTC_NUMBER 24u
#define BLE_bless_isr_INTC_CORTEXM0P_ASSIGNED 1
#define BLE_bless_isr_INTC_CORTEXM0P_MUX 3u
#define BLE_bless_isr_INTC_CORTEXM0P_PRIORITY 3u
#define BLE_bless_isr_INTC_NUMBER 24u

/* WakeUp_interrupt */
#define WakeUp_interrupt__INTC_CORTEXM4_ASSIGNED 1
#define WakeUp_interrupt__INTC_CORTEXM4_PRIORITY 7u
#define WakeUp_interrupt__INTC_NUMBER 19u
#define WakeUp_interrupt_INTC_CORTEXM4_ASSIGNED 1
#define WakeUp_interrupt_INTC_CORTEXM4_PRIORITY 7u
#define WakeUp_interrupt_INTC_NUMBER 19u

#endif /* INCLUDED_CYFITTER_SYSINT_H */
